while True:
    a= float (input ( "Початковий депозит в грн. :"))

    b= float (input ("% -річна ставка : "))

    # c- місячна ставка

    c = b /12

    print ("Місячна ставка становить " + str( round(c,2))+"%")

    print(   )
    #січень

    d = a*(100+c)/100
    print ("Cічень: "+ str ( round (d,2)) +" грн")
    #лютий

    f= d*(100+c)/100
    print ("Лютий: "+ str ( round (f,2)) +" грн")

    #березень

    g= f*(100+c)/100
    print ("Березень: "+ str ( round (g,2)) +" грн")

    #квітень

    h= g*(100+c)/100
    print ("Квітень: "+ str ( round (h,2)) +" грн")

    #травень

    j= h*(100+c)/100
    print ("Травень: "+ str ( round (j,2)) +" грн")

    #червень

    k= j*(100+c)/100
    print ("Червень: "+ str ( round (k,2)) +" грн")

    #липень

    l= k*(100+c)/100
    print ("Липень: "+ str ( round (l,2)) +" грн")
           
    #серпень

    z= l*(100+c)/100
    print ("Серпень :" + str ( round (z,2)) +" грн")

    #вересень

    x= z*(100+c)/100
    print ("Вересень: "+ str ( round (x,2)) +" грн")

    #жовтень

    v= x*(100+c)/100
    print ("Жовтень: "+ str ( round (v,2)) +" грн")

    #листопад
           
    b= v*(100+c)/100
    print ("Листопад: "+ str ( round (b,2)) +" грн")
           
    #грудень
           
    n= b*(100+c)/100
    print ("Грудень: "+ str ( round (n,2)) +" грн")

    input ()
       
